old/simulationV1/0/shell_fluid/h
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/shell_fluid";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 300;  // Example initial temperature in K

boundaryField
{
    shell_outlet
    {
        type            zeroGradient;
    }
    shell_wall
    {
        type            fixedValue;
        value           uniform 300;  // Example wall temperature in K
    }
    shell_inlet
    {
        type            fixedValue;
        value           uniform 350;  // Example inlet temperature in K
    }
    shell_fluid_to_tube_fluid
    {
        type            coupled
        value           uniform 300;  // Example value; this should match the other region's temperature
        kappaMethod     fluidThermo;
        Tnbr            T;
    }
}

// ************************************************************************* //

