old/simulationV1/0/tube_fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/tube_fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    tube_inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    tube_outlet
    {
        type            zeroGradient;
    }
    tube_fluid_to_shell_fluid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
