old/simulationV1/0/tube_fluid/h
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/tube_fluid";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 300;  // Example initial temperature in K

boundaryField
{
    tube_inlet
    {
        type            fixedValue;
        value           uniform 300;  // Example inlet temperature in K
    }
    tube_outlet
    {
        type            zeroGradient;
    }
    tube_fluid_to_shell_fluid
    {
        type            coupled;
        value           uniform 300;  
    }
}

// ************************************************************************* //

