old/simulationV1/constant/shell_fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/shell_fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    shell_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          180;
        startFace       9421;
    }
    shell_wall
    {
        type            wall;
        physicalType    wall;
        inGroups        List<word> 1(wall);
        nFaces          1210;
        startFace       9601;
    }
    shell_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          180;
        startFace       10811;
    }
    shell_fluid_to_tube_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          328;
        startFace       10991;
        neighbourRegion tube_fluid;
        neighbourPatch  tube_fluid_to_shell_fluid;
        transformType   none;
    }
)

// ************************************************************************* //
